_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lambda_1 (Lambda)            (None, 160, 320, 3)       0
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 77, 320, 3)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 75, 318, 16)       448
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 37, 159, 16)       0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 35, 157, 32)       4640
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 17, 78, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 15, 76, 64)        18496
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 7, 38, 64)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 17024)             0
_________________________________________________________________
dense_1 (Dense)              (None, 500)               8512500
_________________________________________________________________
dropout_1 (Dropout)          (None, 500)               0
_________________________________________________________________
dense_2 (Dense)              (None, 100)               50100
_________________________________________________________________
dropout_2 (Dropout)          (None, 100)               0
_________________________________________________________________
dense_3 (Dense)              (None, 20)                2020
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 21
=================================================================
Total params: 8,588,225.0
Trainable params: 8,588,225.0
Non-trainable params: 0.0
_________________________________________________________________
